the common lisp condition system review.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-23 sob 15:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The Common Lisp Condition System review</title>
<meta name="generator" content="Org mode">
<meta name="description" content="Phoe wrote a book!"
>
<meta name="keywords" content="lisp, books">
<link rel="stylesheet" href="static/main.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up-index-page"> <div> <a accesskey="H" href="https://sirherrbatka.github.io"> HOME </a> </div> </div><div id="content">
<header>
<h1 class="title">The Common Lisp Condition System review</h1>
</header><p>
Phoe wrote and published a book. Given how deeply I've stuck in the Common Lisp rabbit hole I had to read and review it.
</p>

<p>
The first things first: is it worth reading? My answer is the clean and sound yes. The content of the book is a complete tour of all stack manipulation facilities of the language. Eventually, the book goes into implementing the whole condition system from the base elements. You truly can't get more Lisp than this.
</p>

<p>
This is not the right book for the novice, but I am sure that it never aspired to be one. There is nothing to criticize in this approach. However, I have other things to complain about, because let me tell you: this is not an easy book to get through even for readers decently familiar with the subject. It boils down to style.
</p>

<p>
Text is convoluted, paragraphs seem to be chaotic and poorly laid out. I had to frequently u-turn and read a sentence from the beginning to get a good grasp of the text message. For instance, consider the following fragment: "It also means, indirectly, that dynamic variables give us way...". This simply does not flow, and sentence structures like that are the norm. Luckily for the reader phoe uses colloquial language. Small mercies.
</p>

<p>
Other than the above: I would love to see a chapter regarding practical design considerations while using lisp conditions. In fact, I would love to read a "Practical Design Considerations for Common Lisp Systems" book in general. Maybe something that phoe can work on in the future? Heck, I would gladly coauthor it.
</p>

<p>
Anyway, grab yourself "The Common Lisp Condition System" and read it. You will learn a thing or two and it will hurt just a little bit.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-01-23 sob 15:39</p>
</div>
</body>
</html>
